app/views/groups/show.html.erb

  <%= @group.users %>
  <% @group.users.each do |f| %>
---
SELECT `users`.* FROM `users` INNER JOIN `groups_users` ON `users`.`id` = `groups_users`.`user_id` WHERE `groups_users`.`group_id` = 30