app/views/users/index.html.erb


    <% @user.orders.each do |order| %>
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 8