app/views/orders/index.html.erb

SELECT `orders`.* FROM `orders`
---
      <tr>
        <td><%= order.order_type %></td>