app/controllers/friendships_controller.rb

	def index
		@user = current_user
		@friendship = Friendship.new
		@friendships = Friendship.all
---
SELECT `friendships`.* FROM `friendships`

	def destroy
	  @friendship = current_user.friendships.find(params[:id])
---
SELECT  `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 8 AND `friendships`.`id` = 2 LIMIT 1