app/controllers/groups_controller.rb

  def update
    respond_to do |format|
      if @group.update(group_params)
---
UPDATE `groups` SET `name` = 'sd', `updated_at` = '2016-05-20 19:26:15' WHERE `groups`.`id` = 30