app/controllers/groups_controller.rb

SELECT `groups`.* FROM `groups`
---
  def index
    @groups = Group.all

SELECT `groups`.* FROM `groups`
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 30 LIMIT 1
---
  def new
    @group = Group.new
    @groups = Group.all

    # show group users
    if (params[:id])
      @group = Group.find(params[:id])

INSERT INTO `groups` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('open source', 1, '2016-05-20 09:42:40', '2016-05-20 09:42:40')
---
  def create
    @group = Group.new(group_params)
      if @group.save

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 3 LIMIT 1
DELETE FROM `groups` WHERE `groups`.`id` = 3
DELETE FROM `groups` WHERE `groups`.`user_id` = 1
---
  def destroy
    if params[:id]
       @group = Group.find(params[:id])
     @group.destroy
      elsif params[:gid]
        @group = Group.find(params[:groupid])
        @user = User.find(params[:gid])
        @group.users.destroy(@user)

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 30 LIMIT 1
---
    def set_group
      @group = Group.find(params[:id])