app/controllers/users_controller.rb

  def index
    if user_signed_in?
      @id = current_user.id

      @user = User.find(current_user.id)
      @friends = Friendship.where("user_id = ?", current_user.id)
      @user_friends = []
      @friends.each do |friend|
        @id = friend.friend_id
        puts @id
        @user_friends << User.find_by(id: @id)
      end
      @orders = Order.last(3)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 8  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `friendships`.* FROM `friendships` WHERE (user_id = 1)
SELECT  `orders`.* FROM `orders`  ORDER BY `orders`.`id` DESC LIMIT 3

  def rsearch
        @user=User.find_by_email(params[:user][:email])
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'yasmin@yahoo.com' LIMIT 1

  def destroy
    @user.destroy
---
DELETE FROM `users` WHERE `users`.`id` = 3

    def set_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 9  ORDER BY `users`.`id` ASC LIMIT 1